title: Failed Login Detection
id: 4625-failed-login
status: experimental
description: Detects failed Windows authentication attempts using Event ID 4625
author: Harilal P
date: 2026-05-27
logsource:
  product: windows
  service: security
detection:
  selection:
    EventID: 4625
  condition: selection
fields:
  - Account_Name
  - Source_Network_Address
  - Logon_Type
  - Failure_Reason
level: medium
tags:
  - attack.credential_access
  - attack.t1110
